/**
 * Created by nina on 3/20/17.
 */
public class Game {
    public static void mainLoop() {
        //Главный цикл игры. Он бесконечный. Выход из него только по вводу пользователя.
        //В начале внутри цикла должна получить у пользователя размер поля и winnumber.
        // Должна проверить, что они не содержат противоречий:
        // виннамбер не больше сайза, оба они не отрицательные и не ноль, размер поля не единица или не 2х2
        //Варианты организации ввода:
        //а)в случае неверного ввода заменить значение на дефолтные;
        //б) повторение внутреннего цикла ввода до тех пор пока не будут введены корректные значения;
        //После ввода создать игровое поле соответствующего размера.
        //Начать выполнение игрового цикла: передавая ход от игрока к игроку, проверяя корректность хода.
        //Дать возможность повторить ход, если он был некорректный.
        //Циклики выделить в отдельные функции.


    }
}
